# Отрицание ( или инверсия)  ЛОГИЧЕСКОЕ "НЕТ"
# Приоритет логических операторов
# 1. not
# 2. and
# 3. or

# flag = True # булева переменная

# Истина - это любое ненулевое значение,
# либо она явна задана как будевой переменной,
# либо все что не нулевое является True
#   пустая строка - это False
"""
flag = ' '  # Значение булевой переменной
if flag:
    print('Включено')
    print('Значение булевой переменной True, '
          '\nтак как строка непустая (есть пробел)!')
else:
    print('Выключено')
    print('Значение булевой переменной False, '
          '\nтак как строка пустая!')

print('Нажали кнопку')
flag = not flag  # инвертирование и переприсваевает
if flag:
    print('Включено')
    print('Инвертировали значение flag')
else:
    print('Выключено')
    print('Инвертировали значение flag')
"""

tie = True