# 2 - это целое число (int)
# 36.6 - это вещественное число (float)
# 'Строкаэ - жто строка (str)
# Чтобы узнать класс переменной либо значения,
# мы можем использовать функции type() и isinstance().
# Это позволяет проверить принадлежность объекта конкретному классу

""" многострочный комментарий правильно многострочная строка
print(4,545)
print(4, 545, 687)
print('Дмитрий')
print(4, 5454, 687, 'Дмитрий')
print('Кафе "Аист"')
"""
a = 5.234523452345
a = 5
b = 'string'
print(a, 'is', type(a), b, 'is', type(b))

print(a, 'is', type(a))
