# Задачка ввести 2 запроса
# сколько стоила булочка, сколько стоил чай
# Вывести Итого: с Вас ___ рублей

# cake = input('Сколько стоила булочка: ')
# tea = input('Сколько стоил чай: ')
#
# print('Итого с Вас: ', int(cake) + int(tea), 'рублей')
#
# total = int(cake) + int(tea)
# print('Итого с Вас: ', total, 'рублей')
#
# total = float(cake) + float(tea)
# print('Итого с Вас: ', total, 'рублей')
# # колько стоила булочка: 10
# # Сколько стоил чай: 145
# # Итого с Вас:  155 рублей
# # Итого с Вас:  155 рублей
# # Итого с Вас:  155.0 рублей

# cake = input('Сколько стоила булочка: ')
# cake = float(cake)
# tea = input('Сколько стоил чай: ')
# tea = float(tea)
# total = cake + tea
# print('Итого с Вас: ', int(total), 'рублей')
# print('Итого с Вас: ', total, 'рублей')

string = """
        Привет,
    учвстникам
 соревнований!
"""
# для интерпритатора это многострочная строка
# ей не присвоена никакая переменная и поэтому
# память под нее не выделяется никаких операций не производится
"""  
Привет, 
учвстникам
соревнований!
"""

print(string)

# a= '400'
# res = int(a)
# print(res)

# a = 62
# res = 'Мне ' + str(a) + " лет"
# print(res)